04/DIGITALBANK_USER_PROFILE-only_JMeter-with_data.yml

# Script generated by Blazemeter Chrome Extension

execution:
- executor: jmeter
  scenario: DIGITALBANK_USER_PROFILE-Http
  concurrency: 20
  ramp-up: 30s
  hold-for: 30s

scenarios:
  DIGITALBANK_USER_PROFILE-Http:
    headers:
      sec-ch-ua: '"Chromium";v="94", "Google Chrome";v="94", ";Not A Brand";v="99"'
      sec-ch-ua-mobile: '?0'
      sec-ch-ua-platform: '"macOS"'
      Upgrade-Insecure-Requests: '1'
      User-Agent: 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/94.0.4606.81 Safari/537.36'      
      Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9'
    data-sources:
    - path: users.csv
      variable-names: emailAddress,firstName,lastName,postalCode
    variables:
      BASE_URL: http://localhost:8888
    requests:
      - transaction: Login
        force-parent-sample: false
        do:
          - url: '${BASE_URL}/bank/login'
            method: GET
            label: '${BASE_URL}/bank/login - GET'
            think-time: 0ms
            headers: {}
          - url: '${BASE_URL}/bank/login'
            method: POST
            label: '${BASE_URL}/bank/login - POST'
            think-time: 349ms
            headers:
              Origin: '${BASE_URL}'
              Content-Type: application/x-www-form-urlencoded
            body:
              password: 'Demo123!'
              username: ${emailAddress}
      - transaction: Click Profile
        force-parent-sample: false
        do:
          - url: '${BASE_URL}/bank/user/profile'
            method: GET
            label: '${BASE_URL}/bank/user/profile'
            assert:
              - assume-success: false
                contains:
                  - ${firstName}
                not: false
                regexp: false
                subject: body
              - assume-success: false
                contains:
                  - ${lastName}
                not: false
                regexp: false
                subject: body
            think-time: 251ms
            headers: {}
      - transaction: Home Page
        force-parent-sample: false
        do:
          - url: '${BASE_URL}/bank/'
            method: GET
            label: '${BASE_URL}/bank/'
            think-time: 879ms
            headers: {}
      - transaction: Logout
        force-parent-sample: false
        do:
          - url: '${BASE_URL}/bank/logout'
            method: GET
            label: '${BASE_URL}/bank/logout'
            assert:
              - assume-success: false
                contains:
                  - "Logout completed"
                not: false
                regexp: false
                subject: body
            think-time: 144ms
            headers: {}